; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		m i s l e k t a f r - block
	)
	(:init
		(handempty)
		(clear f)
		(on f l)
		(ontable l)
		(clear a)
		(on a m)
		(on m t)
		(on t s)
		(ontable s)
		(clear k)
		(on k e)
		(on e i)
		(ontable i)
		(clear r)
		(ontable r)
	)
	(:goal (and
		;; stake
		(clear s) (ontable e) (on s t) (on t a) (on a k) (on k e)
	))
)

; plan
1. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 0 of 6
2. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 0 of 6
3. (unstack e i)
   deleted: (clear e) (handempty) (on e i)
   added: (holding e) (clear i)
   goals met: 0 of 6
4. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 1 of 6
5. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 1 of 6
6. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 2 of 6
7. (unstack a m)
   deleted: (clear a) (handempty) (on a m)
   added: (holding a) (clear m)
   goals met: 2 of 6
8. (stack a k)
   deleted: (holding a) (clear k)
   added: (clear a) (handempty) (on a k)
   goals met: 3 of 6
9. (unstack m t)
   deleted: (clear m) (handempty) (on m t)
   added: (holding m) (clear t)
   goals met: 3 of 6
10. (stack m f)
   deleted: (holding m) (clear f)
   added: (clear m) (handempty) (on m f)
   goals met: 3 of 6
11. (unstack t s)
   deleted: (clear t) (handempty) (on t s)
   added: (holding t) (clear s)
   goals met: 4 of 6
12. (stack t a)
   deleted: (holding t) (clear a)
   added: (clear t) (handempty) (on t a)
   goals met: 5 of 6
13. (pick-up s)
   deleted: (ontable s) (clear s) (handempty)
   added: (holding s)
   goals met: 4 of 6
14. (stack s t)
   deleted: (holding s) (clear t)
   added: (clear s) (handempty) (on s t)
   goals met: 6 of 6
